import './style.css';

const About = () => {
    return (
        <div className="about">
            <strong>
                О компании
            </strong>
            <p>
            	Это Софт - это российская IT-компания. 
                Мы осуществляем полный спектр работ
                в области заказной разработки ПО
                в таких отраслях, как ритеил, финансы,
                промышленность и государственный сектор. 													
            </p>
        </div>
      );
}
 
export default About;