import './career.css';

const Career = () => {
    return (
        <div className='career-container'>
            <div className='career'>
                <p className='switcher-title'>
                    Карьера
                </p>
                <p>       
                    Основа нашей компании - это коллектив.
                    В связи появлением новых проектов,
                    мы постоянно ищем талантливых сотрудников.
                    Успешно сотрудничаем с ВУЗами уральского
                    региона. После прохождения стажировки,
                    студенты принимаются на работу.
                    Каждый в компании имеет возможность к
                    карьерному и профессиональному росту,
                    получению опыта в интересных и сложных
                    проектах.
                </p>
            </div>
        </div>
    );
}
 
export default Career;